// 1. Продумайте структуру класса Кот. Какие поля и методы будут актуальны для приложения, которое является
// а) информационной системой ветеринарной клиники
// б) архивом выставки котов
// в) информационной системой Театра кошек Ю. Д. Куклачёва
// Можно записать в текстовом виде, не обязательно реализовывать в java.


package Seminar6;

public class Task_2 {
    // а) информационной системой ветеринарной клиники  
    //     ID, дату поступления, порода, имя, хозяин, диагноз
    // б) архивом выставки котов
    //     имя, порода, вес, рост, ID, выставки названия, титулы, хозяин
    // в) информационной системой Театра кошек Ю. Д. Куклачёва
    //     Имя, ID, порода, год рождения, навыки, 
    

    
}
